app/Controllers/Home.php

SELECT *
FROM `anggota`
WHERE `no_anggota` = '011'
 LIMIT 1
---
    public function tambah_anggota()
    {
        // Dapatkan nomor anggota terakhir
        $lastNoAnggota = $this->AnggotaModel->getLastNoAnggota();

        // Jika belum ada data, mulai dari '001'
        if ($lastNoAnggota === null) {
            $newNoAnggota = '001';
        } else {
            // Tambah 1 dan format dengan 3 digit, misalnya '002', '010', dll
            $newNoAnggota = str_pad((int) $lastNoAnggota + 1, 3, '0', STR_PAD_LEFT);
        }

        // Cek apakah nomor anggota sudah ada (hindari duplikat)
        $existing = $this->AnggotaModel->where('no_anggota', $newNoAnggota)->first();