app/Models/AnggotaModel.php

    public function getAnggota()
    {
        return $this->findAll();  // cukup findAll() saja sudah otomatis pakai primary key
---
SELECT *
FROM `anggota`

    public function getLastNoAnggota()
    {
        $builder = $this->db->table('anggota');
        $builder->selectMax('no_anggota');
        $query = $builder->get();
---
SELECT MAX(`no_anggota`) AS `no_anggota`
FROM `anggota`

    public function insertAnggota($data)
    {
        return $this->insert($data);  // pakai method model bawaan
---
INSERT INTO `anggota` (`nama`, `no_anggota`, `jenis_kelamin`, `kelas`, `no_hp`, `kode_qr`) VALUES ('b', '011', 'laki-laki', '7C', 'safsfipjdids', 'qr_68ccf1d082928.png')

    public function updateAnggota($id_anggota, $data)
    {
        return $this->update($id_anggota, $data);
---
UPDATE `anggota` SET `nama` = 'Andi', `no_anggota` = '003', `jenis_kelamin` = 'laki-laki', `kelas` = '9C', `no_hp` = '082251154730', `kode_qr` = 'qr_68cced11aaad0.png'
WHERE `anggota`.`id_anggota` IN ('76')

    public function countAnggota()
    {
        return $this->countAll();
---
SELECT COUNT(*) AS `numrows` FROM `anggota`

    public function getAll()
    {
        return $this->findAll();
---
SELECT *
FROM `anggota`