app/Models/AnggotaModel.php

    public function countAnggota()
    {
        // This method counts the number of anggota (members) in the database.
        // It returns the count as an integer.
        return $this->db->table('anggota')->countAll();
---
SELECT COUNT(*) AS `numrows` FROM `anggota`