app/Models/BukuModel.php

SELECT *
FROM `buku`
---
    public function getBuku()
    {
        return $this->db->table("buku")->get()->getResultArray();

SELECT DISTINCT `katalog`
FROM `buku`
ORDER BY `katalog` ASC
---
    public function getKatalog()
    {
        return $this->db->table('buku')
            ->select('katalog')
            ->distinct()
            ->orderBy('katalog', 'ASC')
            ->get()
            ->getResultArray();

SELECT DISTINCT `rak`
FROM `buku`
ORDER BY `rak` ASC
---
    public function getRak()
    {
        return $this->db->table('buku')
            ->select('rak')
            ->distinct()
            ->orderBy('rak', 'ASC')
            ->get()
            ->getResultArray();

SELECT *
FROM `buku`
---
    public function getFilteredBuku($katalog = null, $rak = null)
    {
        $builder = $this->db->table('buku');

        if ($katalog) {
            $builder->where('katalog', $katalog);
        }
        if ($rak) {
            $builder->where('rak', $rak);
        }
        return $builder->get()->getResultArray();