app/Models/BukuModel.php

    public function getBuku()
    {
        return $this->db->table("buku")->get()->getResultArray();
---
SELECT *
FROM `buku`

    public function countBuku()
    {
        // This method counts the number of buku (books) in the database.
        // It returns the count as an integer.
        return $this->db->table('buku')->countAll();
---
SELECT COUNT(*) AS `numrows` FROM `buku`