app/Models/DendaModel.php

SELECT `d`.`id_denda`, `d`.`jumlah_denda`, `d`.`status_denda`, `d`.`tanggal_pembayaran`, `d`.`keterangan`, `a`.`nama`, `a`.`no_anggota`, `p`.`nilai_ganti`
FROM `denda` `d`
JOIN `pengembalian` `p` ON `d`.`id_pengembalian` = `p`.`id_pengembalian`
JOIN `peminjaman` `pm` ON `p`.`id_peminjaman` = `pm`.`id_peminjaman`
JOIN `anggota` `a` ON `pm`.`id_anggota` = `a`.`id_anggota`
---
    public function getDendaWithAnggota()
    {
        return $this->db->table('denda d')
            ->select('d.id_denda, d.jumlah_denda, d.status_denda, d.tanggal_pembayaran, d.keterangan, a.nama, a.no_anggota, p.nilai_ganti')
            ->join('pengembalian p', 'd.id_pengembalian = p.id_pengembalian')
            ->join('peminjaman pm', 'p.id_peminjaman = pm.id_peminjaman')
            ->join('anggota a', 'pm.id_anggota = a.id_anggota')
            ->get()
            ->getResultArray();