app/Models/PeminjamanModel.php

SELECT *
FROM `peminjaman`
---
    public function getPeminjaman()
    {
        return $this->db->table("peminjaman")->get()->getResultArray();

SELECT COUNT(*) AS `numrows` FROM `peminjaman`
---
    public function countPeminjaman()
    {
        return $this->db->table("peminjaman")->countAll();