app/Models/PeminjamanModel.php

    public function getPeminjaman()
    {
        return $this->db->table('peminjaman p')
            ->select('p.*, a.nama, a.no_anggota, b.judul_buku, b.id_buku')
            ->join('anggota a', 'a.id_anggota = p.id_anggota')
            ->join('buku b', 'b.id_buku = p.id_buku')
            ->join('pengembalian pg', 'pg.id_peminjaman = p.id_peminjaman', 'left')
            ->where('pg.id_peminjaman IS NULL') // hanya yang belum dikembalikan
            ->get()
            ->getResultArray();
---
SELECT `p`.*, `a`.`nama`, `a`.`no_anggota`, `b`.`judul_buku`, `b`.`id_buku`
FROM `peminjaman` `p`
JOIN `anggota` `a` ON `a`.`id_anggota` = `p`.`id_anggota`
JOIN `buku` `b` ON `b`.`id_buku` = `p`.`id_buku`
LEFT JOIN `pengembalian` `pg` ON `pg`.`id_peminjaman` = `p`.`id_peminjaman`
WHERE `pg`.`id_peminjaman` IS NULL