app/Models/PengembalianModel.php

SELECT `pg`.`id_pengembalian`, `pg`.`status`, `pg`.`tanggal_pengembalian`, `pg`.`nilai_ganti`, `pg`.`jenis_ganti`, `p`.`jumlah_buku`, `p`.`tgl_peminjaman`, `p`.`batas_waktu`, `a`.`nama`, `a`.`no_anggota`, `b`.`judul_buku`, `d`.`jumlah_denda`
FROM `pengembalian` `pg`
JOIN `peminjaman` `p` ON `p`.`id_peminjaman` = `pg`.`id_peminjaman`
JOIN `anggota` `a` ON `a`.`id_anggota` = `p`.`id_anggota`
JOIN `buku` `b` ON `b`.`id_buku` = `p`.`id_buku`
LEFT JOIN `denda` `d` ON `d`.`id_pengembalian` = `pg`.`id_pengembalian`
ORDER BY `pg`.`tanggal_pengembalian` DESC
---
    public function getAllPengembalian()
    {
        return $this->db->table('pengembalian pg')
            ->select('pg.id_pengembalian, pg.status, pg.tanggal_pengembalian,
                  pg.nilai_ganti, pg.jenis_ganti,
                  p.jumlah_buku, p.tgl_peminjaman, p.batas_waktu,
                  a.nama, a.no_anggota,
                  b.judul_buku,
                  d.jumlah_denda') // tambahkan ini
            ->join('peminjaman p', 'p.id_peminjaman = pg.id_peminjaman')
            ->join('anggota a', 'a.id_anggota = p.id_anggota')
            ->join('buku b', 'b.id_buku = p.id_buku')
            ->join('denda d', 'd.id_pengembalian = pg.id_pengembalian', 'left') // JOIN denda
            ->orderBy('pg.tanggal_pengembalian', 'DESC')
            ->get()
            ->getResultArray();