app/Models/PetugasModel.php

    public function cekLogin($username, $password)
    {

        $user = $this->db->table('petugas')
            ->where('username', $username)
            ->get()
            ->getRowArray();
---
SELECT *
FROM `petugas`
WHERE `username` = 'admin'